package homework3;
/* Задача 1
: Да се изведат на екрана числата от 1 до 100.*/
public class Task1 {

	public static void main(String[] args) {

		for(int i = 1; i <=100; i++) {
			System.out.print(i + " ");
		}		
	}
}
